# ============================================================================
# 付録 C 仮想居住人数
# ============================================================================

def get_n_p(A_A, n_p_in='指定しない'):
    """付録 C 仮想居住人数

    Args:
      A_A(float): 床面積
      n_p_in(str): 居住人数の入力(「1人」「2人」「3人」「4人以上」「指定しない」)

    Returns:
      float: 仮想居住人数

    """

    if n_p_in is not None and n_p_in != '指定しない':
      return {
        '1人': 1.0,
        '2人': 2.0,
        '3人': 3.0,
        '4人以上': 4.0
      }[n_p_in]

    if A_A < 30:
        return 1.0
    elif A_A < 120:
        return A_A / 30
    else:
        return 4.0
